Revit 2027 API
RebarShapeConstraintSegmentLength Methods
The RebarShapeConstraintSegmentLength type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from RebarShapeConstraint)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParamId |  Return the Id of the parameter associated with this constraint.
(Inherited from RebarShapeConstraint)
GetSegmentEndReferenceType |  Choice of two possibilities for the start and end references of the length constraint.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RebarShapeConstraintSegmentLength Class
Autodesk.Revit.DB.Structure Namespace